Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
DG::AppearanceManager Class Reference
Dialog Manager
Manages the application's appearance settings and notifications. More...
#include <DGAppearanceManager.hpp>
 Public Member Functions
~AppearanceManager ()
Destructor for AppearanceManager.
 Static Public Member Functions
static AppearanceMode  | GetMode ()
Gets the current appearance mode.
static AppearanceType  | GetApplicationAppearanceType ()
Gets the application's appearance type.
static AppearanceType  | GetOSAppearanceType ()
Gets the operating system's appearance type.
static AppearanceManager &  | GetInstance ()
Gets the singleton instance of the AppearanceManager.
 Static Public Attributes
 static EventNotifier< AppearanceManager, const AppearanceChangedEventArg >  | onAppearanceChanged
Event notifier for appearance changes.
Detailed Description
Manages the application's appearance settings and notifications.
Member Function Documentation
◆ GetApplicationAppearanceType()
 static AppearanceType DG::AppearanceManager::GetApplicationAppearanceType  |  ( |   | )
static
Gets the application's appearance type.
Returns
The application's appearance type.
◆ GetInstance()
 static AppearanceManager & DG::AppearanceManager::GetInstance  |  ( |   | )
static
Gets the singleton instance of the AppearanceManager.
Returns
The singleton instance.
◆ GetMode()
 static AppearanceMode DG::AppearanceManager::GetMode  |  ( |   | )
static
Gets the current appearance mode.
Returns
The current appearance mode.
◆ GetOSAppearanceType()
 static AppearanceType DG::AppearanceManager::GetOSAppearanceType  |  ( |   | )
static
Gets the operating system's appearance type.
Returns
The operating system's appearance type.